
var list= [
            {
                "coor": "100.996762,25.42597",
                "name": "扶桑国",
                "text": "日本之东南，大汉国之正东。无城郭，民作板屋以居。风俗与太古无异。人无机心，麋鹿与之相亲，人食其乳则寿罕疾，得太阳所出生炁之所薰炙故也。然其东极清，阳光能使万物受其气者，草木尚荣而不悴，况其人乎！"
            },
            {
                "coor": " ",
                "name": "长生国",
                "text": "国在穿胸国之东，秦人曾至其国。其人长大而色黑，有数百岁不死者，其容若少。其地有不死树，食之则寿；有赤泉，饮之不老。盖其国乃在天地灵气之所钟，神明秀气之所荫，凡草木鸟兽皆寿，何况人乎！"
            },
            {
                "coor": "125.772037,39.034169",
                "name": "朝鲜国",
                "text": "朝仙，一曰高丽，在东北海滨，周封箕子之国，以商人五千从之。其医巫卜筮、百工技艺、礼乐诗书皆从中国。衣冠随中国各朝制度，用中国正朔，王子入中国太学读书。风俗华美，人性淳厚，地方东西三千，南北六千。王居开城府，依山为官，曰神窝。民舍多茅茨，鲜陶瓦。以乐浪为东京，百济金州为西京，有郡百八十，镇三百九十，洲岛三十。以鸭绿江为西固，东南至明州，海皆绝碧，至洋则黑海，人谓无底谷也。"
            },
            {
                "coor": "139.812564,35.652885",
                "name": "日本国",
                "text": "大海岛中，岛方千里，即倭国也。其国乃徐福所领童男女始创之国。时福所带之人，百工技艺、医巫卜筮皆全。福因避秦之暴虐，已有遁去不返之意，遂为国焉。而中国诗书遂留于此，故其人多尚作诗写字。自唐方入中国为商，始有奉胡教者，王乃髡发为桑门，穿唐僧衣。其国人皆髡发，孝服则留头。"
            },
            {
                "coor": "102.728214,25.028431",
                "name": "僰人",
                "text": "僬侥。按：许氏《说文》曰：“僰字从其人。”在四夷为最，生居坤地，颇顺其性，故名以人字傍名之也。其国则中庆、威武、大理、永昌等府是也，今滇南者皆是焉。"
            },
            {
                "coor": "96.433048,19.391537",
                "name": "缅人",
                "text": "大理西南，行五十日程可至。种类甚众，与僰人相邻。其人以大被为衣，古称穷荒之之国是也。因知中国之制，颇效之，故其风俗似罗罗。其性狼悍贵勇，尚战斗。"
            },
            {
                "coor": "5.893612,35.427158",
                "name": "木兰皮国",
                "text": "国乃阳盛之方，生物甚旺。在大食国西有巨海，国之西有国不可胜数，可至者惟本兰皮耳。自陀盘地国发舟，正西涉海，百日而至。一舟容数百人，中有酒食肆机杼之属。其国所产麦一粒长三寸，瓜园四五尺，榴一颗重五斤，桃二斤，菜长三四尺。穿井百丈方见泉。胡羊高三四尺，尾大如扇，春则剖腹取膏数十斤，再缝而能复活，药线缝之功也，华佗之术出于此。",
                "info": "穆拉比特王朝"
            },
            {
                "coor": "103.738956,47.079518",
                "name": "鞑靼",
                "text": "名匈奴，一名单于，一名猃狁，一名突厥，一名獯鬻，一名契丹，一名羌胡，一名蒙古，种类甚多。其风俗以鞍马为家，水饮草宿，无城郭房屋。地产羊、马、驼、牛，专以射猎为生，无布帛，衣毛革，俗无鳏寡孤独之人。",
                "info": "蒙古"
            },
            {
                "coor": "98.861026,48.175287",
                "name": "包石 阿思 歪剌 巴赤吉",
                "text": "上四国同。"
            },
            {
                "coor": "74.910831,42.78537",
                "name": "黑契丹",
                "text": "国有城池房屋，耕种牧养为活，出产羊、马。与鞑靼不同，风俗颇类，家室颇富，不与鞑靼相往来。女直金人名马会者曾至其国。",
                "info": "西辽"
            },
            {
                "coor": " ",
                "name": "乞黑奚国",
                "text": "皆野处，水饮草宿，射猎为活，与鞑靼同，与木思奚德国同。"
            },
            {
                "coor": "101.997623,56.845252",
                "name": "土麻",
                "text": "国人烟至烦，似鞑靼。出羊、马，耕种射猎，风俗与西番同。"
            },
            {
                "coor": " ",
                "name": "女暮乐",
                "text": "城池房屋，人烟至多。衣毛革，畜牛、羊，种田射猎为活，鞑靼曾到。"
            },
            {
                "coor": " ",
                "name": "阿里车卢",
                "text": "城在山林中，种田牧放为活。人似鞑靼，与深烈大国同。"
            },
            {
                "coor": " ",
                "name": "波利国",
                "text": "林木，无城池，有房屋。人种田为生，曾与鞑靼为商。"
            },
            {
                "coor": "105.370426,50.735626",
                "name": "灭吉里国",
                "text": "烟极多，言语风俗皆与鞑靼同，其国近西戎。",
                "info": ""
            },
            {
                "coor": " ",
                "name": "摆里荒国 大罗国",
                "text": "与鞑靼同，二国种类相似，皆以鞍马射猎为生。"
            },
            {
                "coor": " ",
                "name": "果鲁果讹",
                "text": "城池，种五谷，出良马。即西胡之种，比胡人有家业，不水饮草宿。"
            },
            {
                "coor": " ",
                "name": "无连蒙古",
                "text": "海岛中，有城池房屋。其人颇富，出貂鼠。其国近西番。"
            },
            {
                "coor": " ",
                "name": "吾凉爱达",
                "text": "鞑靼同种，又在东北上分界。民皆在山林内住，有野马，无牛、羊，打鱼食马乳过日。",
                "info": "兀良哈"
            },
            {
                "coor": " ",
                "name": "结宾郎国",
                "text": "城池，种田，黄头仙人成道处，与西戎相近。好神鬼事，奉佛者多。"
            },
            {
                "coor": " ",
                "name": "七番",
                "text": "山种田，出驼、牛。类北胡，即西番种，俗谓野西番是也。"
            },
            {
                "coor": " ",
                "name": "陇木郎",
                "text": "城一座，昔日番王建都于此，有百姓住坐。地土广，人颇富，乃西戎之国也。"
            },
            {
                "coor": "47.46149,9.664448",
                "name": "大食弼琶罗国",
                "text": "州四座，无国主，唯王豪更互主事。如婚嫁，取有孕牛尾为信，候牛生犊时，始还。娶妻须要男家割阳物曰人尾来，以为聘礼，女家还元割牛尾期信，女家得之甚喜，以鼓乐迎之。地产骆驼鹤，长六七尺，有翼能飞，食杂物，或烧赤热铜铁与之食，生卵如椰子，破之如瓮瓮有声。国人好猎，日射兽而食。",
                "info": "索马里北部"
            },
            {
                "coor": "79.904117,15.970633",
                "name": "注辇国",
                "text": "胡南印度也，自故临易舟行而去，有象六万，背立屋，载勇士，以金银为钱。国人尚气轻生，不同釜而爨，亦不共器而食。",
                "info": "印度乌木海岸"
            },
            {
                "coor": "114.554996,4.542265",
                "name": "娑罗国",
                "text": "人狼戾可畏，男女皆佩刃而行，但与人不睦即刺杀之，奔走他所。一月之内得获则偿命，一月之外出者不论。若他国人至，扪其妇人乳者，自喜曰：“你爱我。”若有私意，即出刃刺杀之。",
                "info": "文莱"
            },
            {
                "coor": "128.430728,44.519076",
                "name": "女真",
                "text": "鸭绿之阳，长白山之下，古肃慎氏之国也。始因新罗人完颜氏者奔于国，遂家焉。地多产金，故女真阿古答称帝，国号大金。其国人皆以鱼鹿之皮为衣，风俗好歌舞，肘■〈月乘〉常带利刃，昼夜不解，轻生重死，好战斗，无畏。所惧者惟野人，与野人为亲者，即刺其面。"
            },
            {
                "coor": "140.383853,53.336652",
                "name": "弩耳干",
                "text": "女真之东北，与狗国相近。其地极寒，雪深丈余。衣狗皮，食狗肉，养狗如中国人养羊，不种田，捕鱼为生。其年鱼多，谓之好收。出海青，产白鹿，有一兽人莫能见，常有蜕下之骨角，如龙骨相似。",
                "info": "奴儿干"
            },
            {
                "coor": " ",
                "name": "大野人",
                "text": "有大山林，男子奶长如瓠，曾被鞑靼追赶至，将奶搭在手上奔走。会人言，食叶，即野人同。"
            },
            {
                "coor": " ",
                "name": "小野人",
                "text": "女真之北，性狠戾，不畏生死，以杀死为吉祥，病终为不利，父子相杀，以为常焉。种类以黥面为号。"
            },
            {
                "coor": "102.895755,35.004181",
                "name": "采牙金彪",
                "text": "西番木波人，其国颇富，有出产，尚财利，为番商者多，罕入中国。"
            },
            {
                "coor": " ",
                "name": "铁东国",
                "text": "国人甚富，出驼、马、牛、羊，与西番相类，即西番之种土番是也。"
            },
            {
                "coor": " ",
                "name": "乌衣国",
                "text": "鞑靼黑海之北，镇抚爬刺曾到，言其人皆衣黑衣，戴大黑巾，拖至膝腕，不令他国人见其面。常带刀行，有见面者，即杀死。其国甚富，所卖之物，皆悬于市蓬之上，他国人欲买者，以物拴其上，方可换；上价少，即追而杀之。人称燕子有乌衣国，非也。"
            },
            {
                "coor": " ",
                "name": "歇祭",
                "text": "国皆平地，多林木，有房舍，人耕种为活。出良马。人黄眼、黄毛发，即黄达子，专务劫掠回回诸国商货。"
            },
            {
                "coor": " ",
                "name": "退波",
                "text": "黑和尚，有城池房舍，出羊、马，林木甚多，与西戎相邻，酋长皆是剌麻主之。"
            },
            {
                "coor": " ",
                "name": "的剌普剌国",
                "text": "城池，民种田，出明珠异宝，番国皆往彼国买卖者多，与撒母耳干境相连。"
            },
            {
                "coor": " ",
                "name": "不剌",
                "text": "西番，出羊、马。人狠恶，尚战斗，罕与诸国通。"
            },
            {
                "coor": "89.605731,42.802501",
                "name": "回鹘",
                "text": "先本匈奴，臣于突厥。突厥资其财力，雄北荒。大业中，自称回纥。子曰菩萨。突厥亡，惟回纥最强。菩萨死，其酋与诸部攻薛延陀，残之，并有其地。"
            },
            {
                "coor": "91.167163,29.653505",
                "name": "吐蕃",
                "text": "蕃本西羌，居析支水西。蕃、发声近，故其子孙曰吐蕃，而姓勃窣野。其俗谓强雄曰赞，大夫曰普，故号君长曰赞普。其后有君长曰论赞，曰弄赞。"
            },
            {
                "coor": "79.920597,37.1226",
                "name": "于阗国",
                "text": "西戎，释氏之国，妇人衫裤束带与男子同，死者以火烧之，收骨而葬也。佛书云：“佛见雁死于地，以沙葬之。”后因之以沙为冢数层，故称曰雁塔。凡人死者，其骨共葬一塔，各依长幼而葬。居丧者剪发长四寸。后佛涅槃，循其故事，亦以沙为冢，其塔自此始。"
            },
            {
                "coor": "54.825763,16.968533",
                "name": "大食勿拔国",
                "text": "国边海，天气暖甚，出乳香树，逐日用刀斫树皮取乳。每年春末有飞禽白天而降，如白丝鹑，肥而味佳。有大鱼高二丈余，长十丈余，人不敢食，刳膏为油，肋可作屋桁，脊骨可作门扇，骨节为舂臼。又有龙涎成块泊岸，人竞取为货卖。"
            },
            {
                "coor": "112.759418,7.249686",
                "name": "大闍婆",
                "text": "国王系始因雷震石裂，有一人出，后立为王，其子孙尚存。产青盐、绵羊、鹦鹉、珍珠、宝贝。又言其国中有飞头者，其人目无瞳子，其头能飞。其俗所祠名曰虫落，因号落民。汉武帝时，因墀国使南方，有解形之民，能先使头飞南海，左手飞东海，右手飞西泽，至暮头还肩上，两手遇疾风飘于海水外。",
                "info": "苏腊巴亚"
            },
            {
                "coor": "83.931293,28.140781",
                "name": "东印度国",
                "text": "性强犷，好杀伐，以战死为吉利，以善终为不祥。昔周伯阳父恶其凶杀，化之，见《周书》。至周庄王九年四月八日，恒星不见，星陨如雨，是夜，释氏生，能修性宗教，国人宗之，称名曰佛。盖佛者如中国称神，彼皆称佛。汉明帝时，其法流入中国。晋明帝时，其法大行。"
            },
            {
                "coor": "72.983417,40.752247",
                "name": "苏都识匿国",
                "text": "名夜义，有野人窟，人近窟住者五百余家。窟口作舍，设关籥，一年再祭。人有逼窟口，烟气出，先触者死，因以尸掷窟口。其窟不知深浅，其人皆如夜叉。"
            },
            {
                "coor": "82.95351,41.713722",
                "name": "龟兹国",
                "text": "武帝兵曾至其国，每至元日斗牛、马、驼为戏，七日观胜负，以占一年羊、马繁息，胜者则旺。",
                "info": "库车"
            },
            {
                "coor": "86.562519,42.053164",
                "name": "焉耆国",
                "text": "于十月十日，王出首领家，首领骑王马一日一夜处分王事。十月十四日作乐。至元日，王及首领分为两朋，各出一人着甲东西互击，甲人先死即止，以占当年丰俭。"
            },
            {
                "coor": " ",
                "name": "马耳打班",
                "text": "人与回回同，食鼠初生未开眼者为上，进王则为孝顺。"
            },
            {
                "coor": " ",
                "name": "入不国",
                "text": "城池，种田，出胡椒。其地至热，即南回回也。其国颇富商贾之利。"
            },
            {
                "coor": "105.134906,24.709157",
                "name": "西南夷",
                "text": "人椎发跣足，衣斑花布，披色毡，背刀带弩。其人勇悍，死而无悔，西戎皆畏之。"
            },
            {
                "coor": "96.203022,36.170914",
                "name": "西番",
                "text": "鬼方，武丁征鬼方，三年克之。又曰鬼阴类，曰鬼戎，曰犬戎。无王子管辖，无城池房舍，多在山林内住，食人肉。其国人奉佛者，皆称剌麻。"
            },
            {
                "coor": " ",
                "name": "鸠尼罗国",
                "text": "新千里国同，此乃西番出佛牙石去处。其石如朽骨，妖妄者做成牙样，曰佛牙，以诳人布施，求其财利。"
            },
            {
                "coor": " ",
                "name": "沙弼茶国",
                "text": "太阳西没之地，有异人名狙葛尼到此，遂立文字。每至晚，日入声若雷霆，国王每于城上聚千人吹角、鸣锣、击鼓，混杂日声，不然则人皆惊死，罕有人至之。"
            },
            {
                "coor": "96.046466,21.85869",
                "name": "蒲甘国",
                "text": "国至富，自大理五程至其国，自窊里国六十程至之。隔黑水淤泥河，西番诸国不可通。国王戴金冠，金银饰屋壁，以锡为瓦用，华丽之甚。"
            },
            {
                "coor": "14.827289,37.5498",
                "name": "斯伽里野国",
                "text": "地乃阴阳击之方，近芦眉国，山上有穴，四季出火。国人扛大石干百斤，纳穴中，须臾爆出，皆碎，五年一次火出。其火流转海边复回，所遇林木不烧，遇石焚之如炭，有神主之。",
                "info": "西西里岛"
            },
            {
                "coor": "46.445941,19.076659",
                "name": "昆仑层期国",
                "text": "国地极热，在西南海上，接海岛，有大鹏飞则蔽日已，能食骆驼。昔有人拾其翎，截管可作水桶。有野人身如墨漆，鬈发，国人布食诱捉，卖与番商作奴，尚货利也。",
                "info": "马达加斯加"
            },
            {
                "coor": "100.57558,13.727107",
                "name": "暹罗国",
                "text": "在海中，民多作商尚利，其名姓皆以中国儒名称呼。其风俗男子皆割阴嵌八宝，人方以女妻之。海中有一岛，岛中之树，其花须一匙二箸，状如黑漆，人用之饮食，其油腻不能污，若搅茶则化。",
                "info": "泰国"
            },
            {
                "coor": "56.448993,27.052762",
                "name": "虎六母思",
                "text": "国在西南海中，回纥之国。其地至热，出番布、珍宝，与西洋国颇同。"
            },
            {
                "coor": "76.293048,9.949639",
                "name": "西洋国",
                "text": "西南海中，地产珊瑚、宝石等物。所织绵布绝细，莹洁如纸。其人髡首，以白布缠头，以金为钱交易，国人至富。",
                "info": "印度科泽科德"
            },
            {
                "coor": "72.804889,33.867903",
                "name": "乌仗那国",
                "text": "国有土神，于此化大蟒，以济饥渴，遂立其国。又与孔雀王啄崖沧泉，以愈众疾，民稍富。"
            },
            {
                "coor": "104.91518,11.549725",
                "name": "真腊国",
                "text": "国极热，即南回回。凡嫁娶，女子九岁乃会亲友，令僧作佛事，以指头挑破女子童体，以血点于母额，以为利事，嫁人夫妇和。十岁即嫁。人与其妻通，其夫即喜。国人为盗，即斩手断足，或以火印烙记黥额，死罪者以木椿穿其尻。",
                "info": "柬埔寨"
            },
            {
                "coor": " ",
                "name": "西棚国",
                "text": "真腊相邻，风俗不同。其国望见天有一窍极明，土人称天门。"
            },
            {
                "coor": "109.902973,7.31371",
                "name": "爪哇国",
                "text": "闍婆国也，自泉州舶一月可到。天无霜雪，四时之气常燠。地产胡椒、苏木，无城池兵甲，无仓廪府库。每遇时节，国王与其属驰马执枪校武，胜者受赏，亲朋踊跃以为喜，伤死者其妻不顾而去。饮食以木叶为盛，手撮而食。宴会则男女列坐，笑喧尽醉。凡草虫之类，尽皆烹食。市贾皆妇人，婚娶多论财，夫丧不出旬日而适人。与中国为商，往来不绝。",
                "info": "爪哇岛"
            },
            {
                "coor": "105.67049,18.510601",
                "name": "道明国",
                "text": "野人同，国人不着衣服，见着衣者即共笑之。俗无盐铁，以竹弩射虫鱼，俗称脱个桂板者此也。"
            },
            {
                "coor": "117.865314,5.686772",
                "name": "近佛国",
                "text": "国人性与禽兽同，在东南海上，多野岛，蛮贼居之，号麻罗奴。商舶至其国，群起擒之，以巨竹夹而烧食，人头为食器。父母死，则召亲戚挝鼓共食其尸肉，非人类比也。"
            },
            {
                "coor": "109.306119,29.619346",
                "name": "散毛",
                "text": "类甚多，喜战斗，不畏死。其诸洞惟散毛洞最大。"
            },
            {
                "coor": "105.819333,21.035547",
                "name": "交州",
                "text": "《舆地志》曰：“周曰骆越，秦曰西瓯，故曰瓯越。汉曰交趾。”杜氏《通典》曰安南。地产金，出象，出香，风景与两广颇同。国朝以为文礼之邦，以元帝之二太子赘婿于陈氏，以奉元祀焉。"
            },
            {
                "coor": "128.105099,26.5846",
                "name": "大琉球国",
                "text": "建安之东，去海五百里。其国多山洞，各部落酋长皆称小王，至生分彼此不知，常入中国贡，王子及陪臣皆入太学读书。",
                "info": "琉球群岛"
            },
            {
                "coor": "121.359494,24.812667",
                "name": "小琉球国",
                "text": "大琉球国同。其人粗俗，少入中国。风俗与倭夷相似。",
                "info": "台湾"
            },
            {
                "coor": "108.955929,14.036412",
                "name": "占城",
                "text": "置林邑郡，其属郡有宾童龙、宾陀陵、化州、王舍城，地方三千余里，南抵真腊，北抵安南。广州发舶，顺风八日可到。国人多姓翁。产名香、犀象、珍宝，常为岁贡，王子入朝中国。比安南不尚文墨，尚战斗，喜师巫邪术。其民有犯讼不能决者，即令过鳄潭。其潭有神鱼，能知人善恶，理亏者鱼即食之。"
            },
            {
                "coor": "100.93591,22.711339",
                "name": "伯夷国",
                "text": "国近云南，风俗与占城同，人皆以墨刺其腿为号，养象如中国养羊、马。其地出宝石、名香。"
            },
            {
                "coor": " ",
                "name": "三伏驮国",
                "text": "西南海中，有山插环流千里，名大铁围山，人不可跻攀，今古无人得到此，天地设险之所也。惟有一窍可入，国人守之，其安南皆不能入，内有良田，珍宝出焉。"
            },
            {
                "coor": "67.878049,38.583387",
                "name": "可只国",
                "text": "番出宝物处，境与撒毋耳干相邻，曰富贵番商，不入中国。"
            },
            {
                "coor": "61.922991,37.608947",
                "name": "马罗国",
                "text": "异宝生头香，即西戎之国。其方多出宝物，人至丑恶可畏。",
                "info": "Merv马里"
            },
            {
                "coor": "77.21596,28.585899",
                "name": "印都丹",
                "text": "人身黑色，地热无云，出佛之处。其国人多奉佛，而勇悍，少有慈心，风上故也。",
                "info": "印度"
            },
            {
                "coor": " ",
                "name": "黑暗国",
                "text": "产犀牛，与回鹘同，即南海中回回也。未尝入中国，其俗皆与西洋同。"
            },
            {
                "coor": " ",
                "name": "天际国",
                "text": "棚国望见天有一痕明亮，即是其国也。其国极富，城池宫室皆如中国，桥梁石柱皆用玉，有华表二根皆玛瑙，产珍宝异香。大概天道左旋，每一年一周，天四极之际天光长多，如骨利国日长夜短是也。其国一年天旋到此，天光返照一遍，国人谓之天门开，非也。"
            },
            {
                "coor": " ",
                "name": "天竺国",
                "text": "隶大秦，国主悉由大秦选择，地产良马。俗皆编发，垂下两鬓。以帛缠头，衫裤鞋袜。国内有圣水，能止风涛，番商人等以琉璃瓶而盛之，若遇风涛，洒之即止，与默枷国水同。"
            },
            {
                "coor": "43.125384,36.316389",
                "name": "大食无斯离国",
                "text": "甘露，秋露降，暴之成糖霜，食之甘美。山有天生栗子，名蒲芦，可采食。次年复生，名麻茶泽；三年再生，名没石子。产麦、桃、榴等物，地窖之物数十年不坏。"
            },
            {
                "coor": "66.968462,39.661893",
                "name": "撒母耳干",
                "text": "西番回鹘之西，其国极富丽，城郭房屋皆与中国同。其风景佳美，有似江南；繁富似中国，商人至其国者多不思归。皆以金银为钱，出宝石、珍玉、良马、狮子。",
                "info": "撒马尔罕"
            },
            {
                "coor": "80.63353,8.096089",
                "name": "私诃条国",
                "text": "女真。金辽山庙有石鼍，如人饮食将尽，向鼍作礼，则饮食悉具。其人多尚巫，谈祸福。",
                "info": "斯里兰卡"
            },
            {
                "coor": "29.008774,41.032864",
                "name": "眉路骨国",
                "text": "国似佛，有城七重，上古用黑光石砌就。有番人冢三百余所，胡称曰塔。一所高八十丈，安三百六十房。人以毛色段为衣，肉面为食，金银为钱，地产硼沙、摩娑石等物。",
                "info": "君士坦丁堡"
            },
            {
                "coor": " ",
                "name": "藏国",
                "text": "国有城池屋舍，地产大柳木，有五丈围者。一日柳国，其空树中可容二十人。"
            },
            {
                "coor": "31.285691,30.082296",
                "name": "勿斯里国",
                "text": "国百年不一雨，止有一天江，不知其源，水极甘，溢则四十日浸田，水退而耕。二年必有一白发人从江水出，坐于石上，国人拜问吉凶。其人不语，若笑则年丰，悲则饥疫，良久复入水。古有狙葛尼建庙，顶上有镜，如他国盗兵来者，先照见之。",
                "info": "埃及"
            },
            {
                "coor": "71.50583,24.975658",
                "name": "南尼华罗国",
                "text": "人好佛教，尊牛，屋壁皆涂牛粪以为洁。各家置坛，以牛粪涂，置花木香供佛。路通西域，常有轻骑来劫，闭门拒之，数日绝粮而退。番商到彼，不得入室。"
            },
            {
                "coor": "71.560762,34.005024",
                "name": "乾驼国",
                "text": "国乃尸毗王之仓库之所，仓为火焚，米皆焦，至今尚存。得一粒服之，则终身无疾。",
                "info": "犍陀罗"
            },
            {
                "coor": "98.556916,13.159919",
                "name": "顿逊国",
                "text": "在海岛上。人将死，亲戚歌舞送于郭外。有鸟如鹅，飞来万数，家人避之，其鸟食肉尽，乃去。即烧骨况水，谓之鸟葬。梁武帝时曾入贡。"
            },
            {
                "coor": "44.403245,33.340447",
                "name": "白达国",
                "text": "王乃佛麻霞勿之子孙。诸国用兵，不敢侵犯。豪民多珍宝，食酥酪饼肉，少鱼菜，产金、银、玻璃等物。人以雪布缠头上，即回鹘之类。",
                "info": "巴格达"
            },
            {
                "coor": "68.817613,33.402378",
                "name": "吉慈尼国",
                "text": "山为城，尚胡教，礼拜堂百余所。出金、银、金丝锦。富民居住七层楼阁，多畜牧驼、马。地极寒，春夏雪不消，有雪蛆可食。",
                "info": "加兹尼"
            },
            {
                "coor": " ",
                "name": "阿萨部",
                "text": "苗，凡食生，皆剖其肉重叠之，以石压沥汁。税波斯、拂林等国。米及草子酿于肉汁之中，经数日变成酒，饮之可醉。喜歌舞。",
                "info": "Khazars"
            },
            {
                "coor": "73.272569,37.534391",
                "name": "婆弥烂国",
                "text": "国有山，巉岩峻险，上多猿。猿形绝长大，常暴田种，每年有二三十万。国中起春已后，屯集兵与猿战，虽岁杀数万，不能尽其巢穴。去金陵二万五千五百五十里。",
                "info": "帕米尔"
            },
            {
                "coor": "72.827623,18.961682",
                "name": "麻离拔国",
                "text": "国产异香、龙涎、珍珠、玻璃、犀角、象牙、珊瑚、木香、没药、血蝎、阿魏、苏合香、没石子等货，皆大食国至此传易，官豪以金绵桃花帛缠头，以金银为钱交易，常为番商。"
            },
            {
                "coor": "99.974839,8.42163",
                "name": "单马令",
                "text": "国有酋长，无王。宋庆元间，进金五坛，金伞一柄。元求其利，不至。国人多富，尚宝货，则利为酋豪。",
                "info": "洛坤府"
            },
            {
                "coor": "93.492906,42.838453",
                "name": "昆吾国",
                "text": "国产宝铁，切玉如泥，及火浣布。其国累堑为丘，象浮图，有三层，尸干居上，尸湿居下，以近葬为孝，集大毡居中悬衣服彩缯，哭祀之。"
            },
            {
                "coor": "103.638706,1.609222",
                "name": "三伏齐国",
                "text": "国在南海之中，自广州发舶，取正南半月可到。诸番水道之要冲，以木栅为城。国人多姓蒲，缚排浮水而居。官兵服药，刀箭不能伤，以此霸于诸国。旧传其国地面忽有一穴，出生牛数万，人取食之，后用竹木窒其穴，乃绝。产犀、象、珠玑、异宝、香药之类。"
            },
            {
                "coor": " ",
                "name": "婆登国",
                "text": "人与回鹘类，在林邑之东，西接迷离国，南接诃陵。种稻每月一熟，有文字即书于贝叶。死者以金钏贯于四肢，后加婆律膏及沉檀龙脑，积薪以焚之。"
            },
            {
                "coor": "101.939945,2.71816",
                "name": "佛罗安国",
                "text": "三佛齐国风帆四昼夜，可到其国，亦可遵陆。有地主。国有飞来铜神二个，一个六臂，一个四臂。六月十五日系佛生日，如有他国人来劫掠，大风骤作，船不可进。"
            },
            {
                "coor": "39.823246,21.425006",
                "name": "麻嘉国",
                "text": "国是土神麻霞勿出世处，称神为佛，庙后有神墓，日夜常有光，人不敢近，皆合眼而走过也。",
                "info": "麦加"
            },
            {
                "coor": "6.07214,32.863493",
                "name": "默伽腊国",
                "text": "国出珊瑚，人用绳缚十字木，以石沉水中，棹船拖索而取，谓铁网取珊瑚。",
                "info": "摩洛哥"
            },
            {
                "coor": "76.845798,8.644901",
                "name": "故临国",
                "text": "大食相近，国人黑色，好事弓弩。中国船往大食，必自故临易小舟而去，往返二年，彼多为盗。",
                "info": "奎隆"
            },
            {
                "coor": "44.191684,26.045736",
                "name": "大食国",
                "text": "海西南山谷间有树，枝上生花如人首，不解语，人借问，惟笑而已，频笑辄落。大食，诸国之总名，有国千余，其属甚多。",
                "info": "阿拉伯诸国"
            },
            {
                "coor": " ",
                "name": "日蒙国",
                "text": "国有房舍，种田出姜，人似黑蒙国结束，即西戎，风俗如回回。"
            },
            {
                "coor": " ",
                "name": "麻阿塔",
                "text": "国有神名金刚民，有城池，种田，即西胡。其人多奉佛，为剌麻者多。"
            },
            {
                "coor": " ",
                "name": "方连鲁蛮",
                "text": "人语话难晓，人种田，出驴、马，风俗与野人相似，但有家业，不水饮草宿耳。"
            },
            {
                "coor": " ",
                "name": "讹鲁",
                "text": "眼深发黄，垒木植为屋宇巢居而已，西胡犬戎之裔也。与野人无异，有巢居穴处之风。"
            },
            {
                "coor": " ",
                "name": "大秦国",
                "text": "番之大国也，番商萃此。其王号麻罗弗，以布帛织出金字缠头。地产珊瑚、生金、花锦、缦布、红玛瑙、珍珠等物，富甚。",
                "info": "争议"
            },
            {
                "coor": "100.188999,58.082993",
                "name": "骨利国",
                "text": "西北浣海之中，南望回鹘，出良马，乃天外地极际之所，故日长而夜短，日光于地下所照故也。日没后，天色正曛，煮羊方熟，天已曙矣。"
            },
            {
                "coor": "29.854526,23.39148",
                "name": "孝亿国",
                "text": "平川中，以木为栅，周十余里，大栅五百余所。气候常暖，冬不凋落。有羊、马，无驼、牛。俗性质真，好客旅，躯貌长大，褰鼻黄发，绿眼赤髭，披发，面如血色。战具惟槊一色。宜五谷，出金铁，衣麻布。有袄祠三千余所，马步甲兵一万。不尚商贩，自称孝臆。丈夫妇人俱佩带。每一日造食；一月食之，常吃宿食。国无河井，种植待雨出而生，以紫矿泥地，承雨水用之。",
                "info": "一说上埃及，另一说索马里桑加亚"
            },
            {
                "coor": " ",
                "name": "新千里国",
                "text": "石似朽骨如牙，奉佛者称为佛牙，此诳人也。与鸠泥国相邻。"
            },
            {
                "coor": " ",
                "name": "玉瑞国",
                "text": "国产牛羊，民种田，有房舍，与西番同。富于西戎，专行诸番为商，少入中国，风俗与回回相类。"
            },
            {
                "coor": "87.060337,25.258416",
                "name": "担波国",
                "text": "国有城池，民种田，天气常热，地无霜雪。出狮子。与回回无异，有国君主之，番商交于邻国。"
            },
            {
                "coor": " ",
                "name": "悄国",
                "text": "西番，人甚狠，专食五谷过活，出牛、羊、马。与野人何异，勇战之士也，少通邻国。"
            },
            {
                "coor": " ",
                "name": "三蛮国",
                "text": "人不种田，只食土，死者埋之，心、肺、肝皆不朽，百年复化为人。一说与无■〈啓，月代口〉国民相类，与野人俗同。"
            },
            {
                "coor": " ",
                "name": "奇疣国",
                "text": "国西去玉门关一万里。其人一臂，性至巧，能作飞车，乘风远行。汤王时，西风久作，车至豫州，汤使人藏其车，不以示民。后十年东风大作，乃令仍乘其车以还。"
            },
            {
                "coor": " ",
                "name": "登流眉国",
                "text": "腊之属郡，椎髻，缠帛蔽身。每朝番王出座，名曰登场，众番皆拜罢同座，交手抱两膊为礼。",
                "info": "丹马令同名异译"
            },
            {
                "coor": "109.076938,7.107643",
                "name": "阿陵国",
                "text": "腊之南，其国竖木为城，造大屋重阁，以棕皮盖之。象牙为床，柳花为酒，以手撮食。有毒女，常人同宿即生疮，与女人交合则必死，旋液着草木即枯。",
                "info": "爪哇梵称"
            },
            {
                "coor": "104.539585,37.574021",
                "name": "义渠国",
                "text": "大秦之西，人死则烧之，薰尸烟上，谓之登烟霞。出犀象宝货，其人与回鹘同。"
            },
            {
                "coor": " ",
                "name": "乌苌国",
                "text": "国民有死罪，不立杀刑，惟徙之空山，任其饮啄。事涉疑似，以药服之，清浊自验，随事轻重而决之。",
                "info": "乌仗那"
            },
            {
                "coor": "44.44437,10.383881",
                "name": "拨拔力国",
                "text": "在西南海中，与野兽同。止食肉，常针牛畜取血和乳生饮之。身无衣，惟腰下用羊皮掩之。"
            },
            {
                "coor": "94.651203,16.718473",
                "name": "波厮国",
                "text": "人矮小极黑，以金花布缦身。无城郭，王以虎皮蒙杌，出则乘软兜或骑象。食饼肉，出异宝等物。",
                "info": "南波斯，另一说在苏门达腊岛东北岸，或爪吐、澎泥彭家之pasir"
            },
            {
                "coor": "92.736835,12.244125",
                "name": "晏陀蛮国",
                "text": "国周围七千里，人如黑漆，能食生人。地无铁，唯磨蚌壳为刃。其国有一圣迹，用浑金作床，承一死人，经代不朽，常有巨蛇卫护。其蛇毛长二尺，人不能近。有一井，一年两次水溢流入海，所过沙石经浸尽成金。"
            },
            {
                "coor": " ",
                "name": "默伽国",
                "text": "系荒郊，无人烟，因大食国祖师蒲罗吽娶妻，在荒野生一子，无水可洗，弃之地下。其子以脚擦地，涌出一泉，甚清彻，此子立名司麻烟，砌成大井，逢旱不干，泛海遇风波，以此水洒之即止。",
                "info": "麦加"
            },
            {
                "coor": " ",
                "name": "胡鬼国",
                "text": "人身长大，无马，步走，手持一长柄斧。其走如飞，逐鹿如犬，专以捕猎为生。兀良河鞑靼因逐鹿偶至其地，为其所执。其胡鬼乃出，遂杀其妻子而出，胡鬼赶至河，不能渡则止。"
            },
            {
                "coor": "108.989734,11.556116",
                "name": "宾童龙国",
                "text": "城之属郡，地主出则骑象或马，打红伞，从者百人，执盾赞唱曰亚或仆。以叶盛饮食。佛书言王舍城即此地也，今有目连舍基存焉。"
            },
            {
                "coor": "110.288867,24.959351",
                "name": "獠",
                "text": "牂牁，其妇人也，七月生子，死则竖棺埋之。有打牙者谓打牙獦獠，种类最多，不可以人事处，张犷难服。"
            },
            {
                "coor": " ",
                "name": "木耳夷",
                "text": "獦獠西，以鹿角为器，其死则屈而烧之，埋耳后小骨。类人，黑如漆，小寒则掊沙自处，但出其面，常入朝中国。"
            },
            {
                "coor": "102.587451,19.459531",
                "name": "潦查",
                "info": "老挝",
                "text": "地产犀、象、金、银，人性至狠，下窝弓毒药杀人。其可笑者，凡水浆之物不从口入，以管于鼻中吸之，大概与象类同。"
            },
            {
                "coor": "102.005176,20.131439",
                "name": "红夷",
                "text": "交州不远，在其境西北，与老抓、占城皆交州唇齿之国。其人不置衣，皆以布绢缠其身首，类回鹘，不产盐。"
            },
            {
                "coor": " ",
                "name": "女人国",
                "text": "国乃纯阴之地，在东南海上，水流数年一泛，莲开长尺许，桃核长二尺。皆有舶舟飘落其国，群女携以归，无不死者。有一智者夜盗船得去，遂传其事。女人遇南风，裸形感风面生。又云与奚部小如者部抵界，其国无男，照井而生，曾有人获至中国。"
            },
            {
                "coor": " ",
                "name": "后眼国",
                "text": "良河鞑靼曾见，不知国在何处。其衣帽与胡人同，项后有一目。其性狠戾，鞑靼多畏之。"
            },
            {
                "coor": " ",
                "name": "阿黑骄",
                "text": "国与野人同，人烟最多，尽在林木中住，无羊马孳畜，射生打鱼为活。"
            },
            {
                "coor": "112.996997,28.171958",
                "name": "盘瓠",
                "text": "喾高辛氏宫中老妇耳内有■〈耳室〉耳，掏出如茧，以瓠盛之，以盘覆之，有顷，化为五色之犬，因名瓠犬。时有犬戎吴将军寇边，帝曰：“得其头，吾以女妻之。”瓠犬俄衔人头诣阙下，乃吴将军之首也。帝不得已，以女妻之。瓠犬负女入南山穴中，三年生六男六女。其母复以状白帝，于是帝封于长沙，武陵蛮今其国人，是其裔也。"
            },
            {
                "coor": "134.173145,50.347692",
                "name": "狗国",
                "text": "国在女真之北，乃阳消阴长之地，得天地之气，驳杂不纯。妇人与人同，穿衣，能人言；男子狗也，不能语，其音狗嗥，不穿衣，食生肉。妇人食熟肉。辽有商人曾至其国，犬遇绝不令归，其妻与箸十余只曰：“汝走数里，可置一枚于地，狗见必衔归家，汝方得脱为善。”狗能护爱家物之意故也。"
            },
            {
                "coor": "108.944416,22.557645",
                "name": "啖人国",
                "text": "乌浒国，按杜氏《通典》：“其国在南海之西南，安南之北，朗宁郡所管。”人生长子辄解而食之，谓之宜弟，味甘则献其君，君赏之，谓之忠。凡父母老则与邻人食之，遗其骨而归之。其邻人之父母老，亦还彼食之。不令自死为葬污地，食则死后免在生之业。凡娶妻美则让其兄。其人蓬头跣足，无衣，以绢缠于身，是其俗也。"
            },
            {
                "coor": "101.21828,23.490387",
                "name": "啰啰",
                "text": "古僰人之国也，盘瓠之种。音出于鼻，性狠恶，不畏死，好食生。髻长一尺向上，以毡衫为衣，以女人为首长，曰母总官。一人纳百夫为贵，其令甚严，刻木牌为令。",
                "info": "彝族"
            },
            {
                "coor": "102.591571,29.568138",
                "name": "阿丹",
                "text": "国与罗罗同，乃西番种类，盘瓠之裔也，与云南四川之境相邻。"
            },
            {
                "coor": "116.544208,4.082832",
                "name": "沙华公国",
                "text": "海寇也，其国在东南海中，其人常出大海劫夺人，卖之于闍婆国。",
                "info": "另一说在苏拉威西岛和马鲁古群岛一带"
            },
            {
                "coor": "109.835681,6.925682",
                "name": "莆家龙",
                "text": "海之东，广州发舶，顺风一月可到。国王撮髻脑后，人民剃头，以椰子挞水浆为酒，其色红白，而味极佳。出胡椒、檀香、沉香、丁香、白豆蔻，常入贡。"
            },
            {
                "coor": " ",
                "name": "昏吾散僧",
                "text": "山林中，人种田以食，与西番同，乃小部落之国也，但有酋长主之。"
            },
            {
                "coor": " ",
                "name": "黑蒙国",
                "text": "国至富，有城池房舍。民种田。天气常热，人穿五色锦裤。其人多富，尚侈靡。"
            },
            {
                "coor": "110.586185,21.192154",
                "name": "蜒蛮",
                "text": "广取珠之蜒户是也，蜒有三：一为鱼蜒，善举网垂纶；二为蚝蜒，善没海取蚝；三为木蜒，善伐木取材。蜒极贫，皆鹑衣，得物米，妻子共之。"
            },
            {
                "coor": "109.179935,28.550807",
                "name": "五溪蛮",
                "text": "洞蛮。遇父母死，行鼓踏歌，饮宴一月，尽产为椁，临江高山凿龛以葬，三年不食盐。"
            },
            {
                "coor": "111.684818,23.961215",
                "name": "生黎",
                "text": "两广山谷中，与洞蛮同。科头跣足，短裙结带，头上诸物皆插；善强弩，食生肉，以猴为鲊，以鼠为煎，曰蜜唧唧。其性凶悍，不当差使。"
            },
            {
                "coor": "110.981693,22.669838",
                "name": "熟黎",
                "text": "城邑者颇循教化，其俗与生黎同。在广西亦有州牧所属。"
            },
            {
                "coor": " ",
                "name": "苗",
                "text": "类最多。凡草虫皆生食，凡肉作令生蛆方食。娶妻答歌相合，遂为夫妇。父母老，卖与人家为奴，谓死后无罪。"
            },
            {
                "coor": "107.531986,25.319259",
                "name": "洞蛮",
                "text": "土官掌之，其人皆与广西人同。食蛇鼠为上等之馔，以猴肉为鲊，其人皆能下蛊杀人。"
            },
            {
                "coor": "94.419803,51.686219",
                "name": "都播国",
                "text": "野人同类，铁勒之别种，分为三部，自相统摄。结草为庐，不知耕稼，多百合，取以为粮。衣貂鹿皮，鸟羽为服。国无刑罚，盗者倍征赃。",
                "info": "图瓦"
            },
            {
                "coor": " ",
                "name": "无腹国",
                "text": "海东南。男女皆无腹肚，其说恐谬，无腹安能生育。"
            },
            {
                "coor": " ",
                "name": "无■〈啓，月代口〉国",
                "text": "东海中。人无肚肠，食土穴居，男女死即埋之，其心不朽，百年化为人。录民膝不朽，埋之百二十年化为人；细民肝不朽，埋之八年化为人。"
            },
            {
                "coor": " ",
                "name": "穿胸国",
                "text": "盛海东。胸有窍，尊者去衣，令卑者以竹木贯胸抬之。俗谓防风氏之民，因禹杀其君，乃刺其心，故有是类。"
            },
            {
                "coor": "80.527591,43.858343",
                "name": "乌孙国",
                "text": "国西有三爪蛮，有头目地主，种田。身生长毛，出虏掠百姓，昔封乌孙公主之所。"
            },
            {
                "coor": "108.053836,55.081548",
                "name": "丁灵国",
                "text": "国在海内。人从膝下生毛，马蹄善走，自鞭其脚，一日可行三百里。"
            },
            {
                "coor": " ",
                "name": "柔利国",
                "text": "人类妖，非人比也。曲膝向前，一手一足。《山海经》云：“在一目国东。”"
            },
            {
                "coor": " ",
                "name": "羽民国",
                "text": "海东南岸巘间，有人长颊鸟喙，赤目白首，身生毛羽，能飞不能远，似人而卵生穴处，即兽蝙蝠之类也。"
            },
            {
                "coor": " ",
                "name": "小人国",
                "text": "山海经》曰：“东方有小人国，名曰靖。”长九寸，海鹤遇而吞之。昔商人曾至海中见之，乃在海尾闾穴所也。"
            },
            {
                "coor": " ",
                "name": "聂耳国",
                "text": "人与兽相类，在无腹国东。其人虎文，耳长过腰，手捧耳而行。"
            },
            {
                "coor": " ",
                "name": "交颈国",
                "text": "脚胫曲而相交，与鬼相类，不正之气也。"
            },
            {
                "coor": " ",
                "name": "长臂人",
                "text": "水中兽类同，在海之东。人垂手至地，专食鱼虾。昔有人在海中得一布衣，袖各长丈余。"
            },
            {
                "coor": "73.523807,33.856785",
                "name": "悬渡国",
                "text": "猿属，在乌耗之西，山溪不通，但引绳而渡。土人佃于石间，垒石为室，接手而饮，互相牵引与兽同。"
            },
            {
                "coor": " ",
                "name": "猴孙国",
                "text": "抹刊剌国。若有别国兵来，众猴防直有法，即不敢来侵犯，与兽同类。"
            },
            {
                "coor": " ",
                "name": "婆罗遮国",
                "text": "人猴面人身，男女无昼夜歌舞，八月十五日行像及透索为戏，猴属也。其种类皆以狗头皮为帽。"
            },
            {
                "coor": " ",
                "name": "缴濮国",
                "text": "人有尾，欲坐则先穿地作穴，以安其尾，如或误折其尾，卒然而死。在永昌郡南二千里。"
            },
            {
                "coor": "150.842838,46.449256",
                "name": "文身国",
                "text": "国极富，专用实货，物至贱，行不赍粮。王居饰以金玉，市用珍宝交易，尚财利，好作商。凡人皆文其身，多者为贵。"
            },
            {
                "coor": "161.397953,55.748794",
                "name": "大汉国",
                "text": "国在大汉之中，人鲜有到者。无兵戈，不攻战；衣毛革，与文身国同，而言语异，即野人国。"
            },
            {
                "coor": " ",
                "name": "长人国",
                "text": "人长三四丈。昔明州二人泛海，值雾昏风大，不知舟所向，天稍开，乃在岛下。登岸伐薪，忽见一长人，其行如飞，二人急走至船上。其长人入海追之，遂前执船，舟人用弩射而退，方得脱。朝有使往辽阳，因风其舟，至其国。其人拿其舟，斩其一指，大若人臂，即此国也。"
            },
            {
                "coor": " ",
                "name": "三首国",
                "text": "夏后启北。其人一身三首，无衣，天地间之异气也。"
            },
            {
                "coor": " ",
                "name": "三身国",
                "text": "凿齿国东。其人一首三身，非妖而何？人罕见也，俗传有之。"
            },
            {
                "coor": " ",
                "name": "一臂国",
                "text": "西海之北。其人一目、一孔、一手、一足，半体比肩，犹鱼鸟相合。"
            },
            {
                "coor": " ",
                "name": "一目国",
                "text": "北海外。其人一目当其面，而手足皆具也。"
            },
            {
                "coor": " ",
                "name": "长脚国",
                "text": "长臂人类本同，常负长臂人入海捕鱼，非水族之类而何？"
            },
            {
                "coor": "142.649784,43.516735",
                "name": "长毛国",
                "text": "在玄股之北，居大海中。人短小，面体皆有长毛，被发，无衣，与猩猩之属同。妇人做王，有城池，种田，居穴中。晋永嘉四年曾获得之，莫晓其语。"
            },
            {
                "coor": " ",
                "name": "氏人国",
                "text": "建木西。其状人面鱼身，有手无足，胸以上似人，以下似鱼。能人言，有群类，巢居穴处为生，有酋长。"
            },
            {
                "coor": " ",
                "name": "南罗国",
                "text": "小国五十四处，多产异宝。"
            },
            {
                "coor": "101.246667,6.860741",
                "name": "赤上国",
                "text": "《唐史》：“自交州海行三月可到。”"
            },
            {
                "coor": " ",
                "name": "般番国",
                "text": "《唐史》：“其国有二十四州，与狼牙接界，交州海行四十日可到。”"
            }
        ]
